import React from "react";
import { Button, Header, Icon, Modal, List } from "semantic-ui-react";

function ModalMain() {
  const [open, setOpen] = React.useState(false);

  return (
    <Modal
      closeIcon
      open={open}
      trigger={<Button>Περισσότερα...</Button>}
      onClose={() => setOpen(false)}
      onOpen={() => setOpen(true)}
    >
      <Header icon="mail" content="Λίγα λόγια για να με γνωρίσετε." />
      <Modal.Content className="px-5">
        <h6>
          Είμαι η <strong>Φωτεινή Βαρδή</strong> διακεκριμένη ασφαλιστική
          σύμβουλος στην Εθνική Ασφαλιστική.
        </h6>
        <p>
          Δραστηριοποιούμαι στην εταιρία από το 2002 και διαθέτω εξειδικευμένη
          εμπειρία στην αποτελεσματική διαχείριση κινδύνων συνάπτοντας συμβόλαια
          για φυσικά και νομικά πρόσωπα σχετικά με τη ζωή , την υγεία, την
          περιουσία, τα θέματα της κληρονομιάς ,της αστικής ευθύνης και του
          σύνθετου κλάδου των εταιρικών ασφαλίσεων .
        </p>
        <h6>Αυτό πιστοποιείται από τις διακρίσεις μου όπως</h6>
        <List bulleted>
          <List.Item>
            Τιμήθηκα το 2006 με τον τίτλο της κορυφαίας ασφαλιστικής συμβούλου
            της χρονιάς.
          </List.Item>
          <List.Item>
            Είμαι ισόβιο μέλος κορυφαίων ασφαλιστικών συμβούλων της LIMRA
            INTERNATIONAL (Ευρωπαϊκός εκπαιδευτικός οργανισμός ασφαλιστικών
            συμβούλων) από το 2009.
          </List.Item>
          <List.Item>
            Κατέχω στην εταιρία από τα μεγαλύτερα και μακροβιότερα χαρτοφυλάκια
            με τους υψηλότερους δείκτες διατήρησης μακροχρόνιας σχέσης με τους
            ασφαλισμένους μου με γνώμονα τη συνεχή αναβάθμιση του γνωστικού μου
            αντικειμένου, την επικοινωνία και την άριστη εξυπηρέτηση τους .
          </List.Item>
        </List>
        <p>
          Είναι επίσης σημαντικό ότι διαθέτω δίπλα μου συνεργάτες με τους
          οποίους ηγούμαστε σήμερα στην ελληνική ασφαλιστική αγορά βραβευόμενοι
          ως το ποιοτικότερο και παραγωγικότερο γραφείο πανελλαδικά της Εθνικής
          Ασφαλιστικής, το Γραφείο Σπ Τότολου .
        </p>
        <p>
          Ανήκουμε δε στη δομή της Επιθεώρησης του κ Γ.Φουφόπουλου η οποία
          βραβεύεται τα τελευταία 17 συναπτά έτη ως η ΠΡΩΤΗ της ΠΡΩΤΗΣ εταιρίας
          στο χώρο μας και η οποία αριθμεί 100.000 ασφαλισμένους και 60.000.000
          τζίρο για το 2020.
        </p>
        <p>
          Για εσάς τους ασφαλισμένους μας η δύναμη μας αυτή είναι η δική σας
          δύναμη στην έμπειρη, υπεύθυνη και αποτελεσματική διαχείριση των
          συμβολαίων σας .
        </p>
        <p>
          Θα χαρώ να βρείτε ωφέλιμη την πρόταση που μελέτησα για εσάς και να
          συνεργαστούμε.
        </p>
        <p>Φιλικά</p>
        <p>Φωτεινή Βαρδή</p>
      </Modal.Content>
      <Modal.Actions>
        <Button color="gray" onClick={() => setOpen(false)}>
          <Icon name="checkmark" color="black" />
        </Button>
        <Button color="gray" onClick={() => setOpen(false)}>
          <Icon name="checkmark" color="black" />
        </Button>
      </Modal.Actions>
    </Modal>
  );
}
export default ModalMain;
